### DataFrames seleção Condicional set-index

In [1]:
import pandas as pd
import numpy as np

In [2]:
from numpy.random import randn
np.random.seed(101)

In [3]:
# Criando um DataFrame com números aleátorios
df = pd.DataFrame(randn(5,4), index="A B C D E".split(), columns="W X Y Z".split()); df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [4]:
# Posso definir uma variável para o meu dataframe boleano
bol = df > 0; bol

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [5]:
# Usando o método anteiror como classificador em meu dataframe
df[bol]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [6]:
# Outra forma de classificação de exibição para dataframes
df[df["X"]>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
C -2.018168  0.740122  0.528813 -0.589001
E  0.190794  1.978757  2.605967  0.683509

In [7]:
# Podemos efetuar uma condição e colocar uma coluna(ou colunas) para exibição
df[df["W"]>0]["Y"]

A    0.907969
B   -0.848077
D   -0.933237
E    2.605967
Name: Y, dtype: float64

In [8]:
# Podemos usar outro método para filtrar valores do dataframes 
bol = df["W"]>0
df2 = df[bol]
df2["Y"]

A    0.907969
B   -0.848077
D   -0.933237
E    2.605967
Name: Y, dtype: float64

In [9]:
# Usando outra abordagem para filtrar elementos de um dataframe
df[(df["W"]>0) & (df["Y"]>1)]
# Para adicionar um operador "e" usamos o operador "&" e para "ou" usamos o operador "|"

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [10]:
# Para resetar o indices do dataframe em uso utilizamos o método index
df.reset_index(inplace=True); df

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [11]:
# Definindo um index para coluna 
col = "RS RJ SP AM SC".split()

In [13]:
# Criando uma nova coluna
df["Estados"] = col; df

  index         W         X         Y         Z Estados
0     A  2.706850  0.628133  0.907969  0.503826      RS
1     B  0.651118 -0.319318 -0.848077  0.605965      RJ
2     C -2.018168  0.740122  0.528813 -0.589001      SP
3     D  0.188695 -0.758872 -0.933237  0.955057      AM
4     E  0.190794  1.978757  2.605967  0.683509      SC